cmsis-svd/cmsis-svd/data/STMicro/STM32WB15.svd
            <register>
               <name>ICR</name>
               <displayName>ICR</displayName>
               <description>Interrupt clear register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ALERTCF</name>
                     <description>Alert flag clear</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMOUTCF</name>
                     <description>Timeout detection flag               clear</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECCF</name>
                     <description>PEC Error flag clear</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRCF</name>
                     <description>Overrun/Underrun flag               clear</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARLOCF</name>
                     <description>Arbitration lost flag               clear</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BERRCF</name>
                     <description>Bus error flag clear</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOPCF</name>
                     <description>Stop detection flag clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NACKCF</name>
                     <description>Not Acknowledge flag clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDRCF</name>
                     <description>Address Matched flag clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PECR</name>
               <displayName>PECR</displayName>
               <description>PEC register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PEC</name>
                     <description>Packet error checking               register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXDR</name>
               <displayName>RXDR</displayName>
               <description>Receive data register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>8-bit receive data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXDR</name>
               <displayName>TXDR</displayName>
               <description>Transmit data register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>8-bit transmit data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="I2C1">
         <name>I2C3</name>
         <baseAddress>0x40005C00</baseAddress>
         <interrupt>
            <name>I2C3_EV</name>
            <description>I2C3 event interrupt</description>
            <value>32</value>
         </interrupt>
         <interrupt>
            <name>I2C3_ER</name>
            <description>I2C3 error interrupt</description>
            <value>33</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>Flash</name>
         <description>Flash</description>
         <groupName>Flash</groupName>
         <baseAddress>0x58004000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x90</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FLASH</name>
            <description>Flash global interrupt</description>
            <value>4</value>
         </interrupt>
         <registers>
            <register>
               <name>ACR</name>
               <displayName>ACR</displayName>
               <description>Access control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000600</resetValue>
               <fields>
                  <field>
                     <name>LATENCY</name>
                     <description>Latency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PRFTEN</name>
                     <description>Prefetch enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICEN</name>
                     <description>Instruction cache enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCEN</name>
                     <description>Data cache enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICRST</name>
                     <description>Instruction cache reset</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCRST</name>
                     <description>Data cache reset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PES</name>
                     <description>CPU1 CortexM4 program erase suspend               request</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPTY</name>
                     <description>Flash User area empty</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR</name>
               <displayName>KEYR</displayName>
               <description>Flash key register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEYR</name>
                     <description>KEYR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPTKEYR</name>
               <displayName>OPTKEYR</displayName>
               <description>Option byte key register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPTKEYR</name>
                     <description>Option byte key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>Status register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EOP</name>
                     <description>End of operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>Operation error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PROGERR</name>
                     <description>Programming error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WRPERR</name>
                     <description>Write protected error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PGAERR</name>
                     <description>Programming alignment               error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SIZERR</name>
                     <description>Size error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PGSERR</name>
                     <description>Programming sequence error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MISERR</name>
                     <description>Fast programming data miss               error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FASTERR</name>
                     <description>Fast programming error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OPTNV</name>
                     <description>User Option OPTVAL               indication</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RDERR</name>
                     <description>PCROP read error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OPTVERR</name>
                     <description>Option validity error</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BSY</name>
                     <description>Busy</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CFGBSY</name>
                     <description>Programming or erase configuration               busy</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PESD</name>
                     <description>Programming or erase operation               suspended</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Flash control register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xC0000000</resetValue>
               <fields>
                  <field>
                     <name>PG</name>
                     <description>Programming</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>Page erase</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MER</name>
                     <description>This bit triggers the mass erase (all               user pages) when set</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PNB</name>
                     <description>Page number selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>STRT</name>
                     <description>Start</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPTSTRT</name>
                     <description>Options modification start</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTPG</name>
                     <description>Fast programming</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOPIE</name>
                     <description>End of operation interrupt               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRIE</name>
                     <description>PCROP read error interrupt               enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OBL_LAUNCH</name>
                     <description>Force the option byte               loading</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPTLOCK</name>
                     <description>Options Lock</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>FLASH_CR Lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECCR</name>
               <displayName>ECCR</displayName>
               <description>Flash ECC register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR_ECC</name>
                     <description>ECC fail address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SYSF_ECC</name>
                     <description>System Flash ECC fail</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCCIE</name>
                     <description>ECC correction interrupt               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CPUID</name>
                     <description>CPU identification</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCC</name>
                     <description>ECC correction</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ECCD</name>
                     <description>ECC detection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
