cmsis-svd/cmsis-svd/data/STMicro/STM32WB15.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DBGMCU</name>
         <description>Debug support</description>
         <groupName>DBGMCU</groupName>
         <baseAddress>0xE0042000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>IDCODE</name>
               <displayName>IDCODE</displayName>
               <description>MCU Device ID Code Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DEV_ID</name>
                     <description>Device Identifier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>REV_ID</name>
                     <description>Revision Identifier</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Debug MCU Configuration           Register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_SLEEP</name>
                     <description>Debug Sleep Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_STOP</name>
                     <description>Debug Stop Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_STANDBY</name>
                     <description>Debug Standby Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRACE_IOEN</name>
                     <description>Trace port and clock               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRGOEN</name>
                     <description>External trigger output               enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1FZR1</name>
               <displayName>APB1FZR1</displayName>
               <description>APB1 Low Freeze Register CPU1</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIMER2_STOP</name>
                     <description>Debug Timer 2 stopped when Core is               halted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_RTC_STOP</name>
                     <description>RTC counter stopped when core is               halted</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_WWDG_STOP</name>
                     <description>WWDG counter stopped when core is               halted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_IWDG_STOP</name>
                     <description>IWDG counter stopped when core is               halted</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C1_STOP</name>
                     <description>Debug I2C1 SMBUS timeout stopped when               Core is halted</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C3_STOP</name>
                     <description>Debug I2C3 SMBUS timeout stopped when               core is halted</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_LPTIM1_STOP</name>
                     <description>Debug LPTIM1 stopped when Core is               halted</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2AP_B1FZR1</name>
               <displayName>C2AP_B1FZR1</displayName>
               <description>APB1 Low Freeze Register CPU2</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_LPTIM2_STOP</name>
                     <description>LPTIM2 counter stopped when core is               halted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_RTC_STOP</name>
                     <description>RTC counter stopped when core is               halted</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_IWDG_STOP</name>
                     <description>IWDG stopped when core is               halted</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C1_STOP</name>
                     <description>I2C1 SMBUS timeout stopped when core is               halted</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C3_STOP</name>
                     <description>I2C3 SMBUS timeout stopped when core is               halted</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_LPTIM1_STOP</name>
                     <description>LPTIM1 counter stopped when core is               halted</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1FZR2</name>
               <displayName>APB1FZR2</displayName>
               <description>APB1 High Freeze Register CPU1</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_LPTIM2_STOP</name>
                     <description>LPTIM2 counter stopped when core is               halted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2APB1FZR2</name>
               <displayName>C2APB1FZR2</displayName>
               <description>APB1 High Freeze Register CPU2</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_LPTIM2_STOP</name>
                     <description>LPTIM2 counter stopped when core is               halted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB2FZR</name>
               <displayName>APB2FZR</displayName>
               <description>APB2 Freeze Register CPU1</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIM1_STOP</name>
                     <description>TIM1 counter stopped when core is               halted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM16_STOP</name>
                     <description>TIM16 counter stopped when core is               halted</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM17_STOP</name>
                     <description>TIM17 counter stopped when core is               halted</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2APB2FZR</name>
               <displayName>C2APB2FZR</displayName>
               <description>APB2 Freeze Register CPU2</description>
               <alternateRegister>C2APB1FZR2</alternateRegister>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIM1_STOP</name>
                     <description>TIM1 counter stopped when core is               halted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM16_STOP</name>
                     <description>TIM16 counter stopped when core is               halted</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM17_STOP</name>
                     <description>TIM17 counter stopped when core is               halted</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
